## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-10-04T14:50:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:507252742351:s50ry4jhg5/" -> (known after apply)
      ~ id                = "9h7m7t" -> (known after apply)
      ~ invoke_url        = "https://s50ry4jhg5.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "343a2be0b3a4d9be06adcf77effce390" -> "c5e2860a9a248e3b1a4bc39596c929cc" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "9h7m7t" -> (known after apply)
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
      ~ xray_tracing_enabled  = false -> true
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.write_waf_logs must be replaced
-/+ resource "aws_iam_policy" "write_waf_logs" {
      ~ arn         = "arn:aws:iam::507252742351:policy/scan-websites_WriteLogs" -> (known after apply)
      ~ description = "Allow writing WAF logs to S3 + CloudWatch" -> "Allow writing WAF logs to S3" # forces replacement
      ~ id          = "arn:aws:iam::507252742351:policy/scan-websites_WriteLogs" -> (known after apply)
        name        = "scan-websites_WriteLogs"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:AbortMultipartUpload",
                          - "s3:GetBucketLocation",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                          - "s3:ListBucketMultipartUploads",
                            "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      ~ Resource = [
                          + "arn:aws:s3:::cbs-satellite-507252742351/waf_acl_logs/*",
                            "arn:aws:s3:::cbs-satellite-507252742351",
                          - "arn:aws:s3:::cbs-satellite-507252742351/waf_logs/*",
                        ]
                      ~ Sid      = "" -> "S3PutObjects"
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
      ~ policy_id   = "ANPAXMGU6TDHQQOBDF4HB" -> (known after apply)
        tags        = {
            "CostCentre" = "scan-websites-production"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.write_waf_logs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      ~ id         = "scan-websites-logs-20220128210127743400000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::507252742351:policy/scan-websites_WriteLogs" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_kinesis_firehose_delivery_stream.api_waf will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "api_waf" {
        id             = "arn:aws:firehose:ca-central-1:507252742351:deliverystream/aws-waf-logs-scan-websites"
        name           = "aws-waf-logs-scan-websites"
        tags           = {
            "CostCentre" = "scan-websites-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          ~ prefix             = "waf_logs/" -> "waf_acl_logs"
            # (6 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.scan_websites_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-websites"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.axe-core-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.github-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.body_exclusions"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.google_auth_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.rds.aws_iam_policy.read_connection_string"]

28 tests, 8 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
